added ADR and context Awareness
